Repository: lang-uk/translation-metrics
Catalog: data/17099743/Animal-Farm_preface.tmx
Source language: en_1945_george_orwell_animal_farm
Languages: uk_2020_bohdana_nosenok_kolhosp_tvaryn

source: The following of my books might most interest the ordinary reader (should any reader of this translation find copies of them): Burmese Days (a story about Burma), Homage to Catalonia (arising from my experiences in the Spanish Civil War), and Critical Essays (essays mainly about contemporary popular English literature and instructive more from the sociological than from the literary point of view).
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Ось мої книжки, які можуть зацікавити пересічного читача (на випадок, якщо хтось із них натрапить на ці примірники): «Бірманські дні» (історія про Бірму), «Вшанування Каталонії» (книжка, що виросла з мого досвіду участі в громадянській війні в Іспанії) і «Критичні нариси» (есеї, у яких ідеться переважно про популярну сучасну англійську літературу, повчальні більше з соціологічної, аніж із літературної точки зору).
